tap "homebrew/services"
tap "koekeishiya/formulae"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# General-purpose data compression with high compression ratio
brew "xz"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# LLM inference in C/C++
brew "llama.cpp"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Tool for managing OCI containers and pods
brew "podman"
# Library for command-line editing
brew "readline"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Messaging and streaming broker
brew "rabbitmq", restart_service: :changed
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Command-line interface for SQLite
brew "sqlite"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Simple terminal image viewer written in Rust
brew "viu"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Free and open-source web browser
cask "chromium"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# App for launching iOS and Android simulators
cask "minisim"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cross-platform video editor
cask "openshot-video-editor"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# VPN client focusing on security
cask "protonvpn"
# App that enables mouse-free UI interaction
cask "shortcat"
# System monitor for the menu bar
cask "stats"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Unpacks archive files
cask "the-unarchiver"
# Menu bar pomodoro timer
cask "tomatobar"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Rust-based terminal
cask "warp"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
mas "AdGuard Mail", id: 6499493699
mas "BBEdit", id: 404009241
mas "Boop", id: 1518425043
mas "CapCut", id: 1500855883
mas "Couverture", id: 1552415914
mas "Developer", id: 640199958
mas "DevHub", id: 6476452351
mas "Jiffy reader", id: 6444754311
mas "JSON Thru", id: 6741684101
mas "Keynote", id: 409183694
mas "Linearity Curve", id: 1219074514
mas "Minimal Twitter", id: 1668204600
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Orbot", id: 1609461599
mas "Pages", id: 409201541
mas "Pdf Editor", id: 1670185874
mas "PDFgear", id: 6469021132
mas "Picture-In-Picture", id: 6475380719
mas "Portal", id: 1436994560
mas "RunCat", id: 1429033973
mas "Sequel Ace", id: 1518036000
mas "Sink It", id: 6449873635
mas "SnippetsLab", id: 1006087419
mas "Swift Playground", id: 1496833156
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "uBlock Origin Lite", id: 0
mas "Userscripts", id: 1463298887
mas "WhatsApp", id: 310633997
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "amazonwebservices.amazon-q-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "augment.vscode-augment"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-markdown"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franzgollhammer.jb-fleet-dark"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "marscode.marscode-extension"
vscode "mattflower.aider"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "visualstudioexptteam.vscodeintellicode-insiders"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "zignd.html-css-class-completion"
