tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/git"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# GO Simple Tunnel - a simple tunnel written in golang
brew "gost"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# LLM inference in C/C++
brew "llama.cpp"
# Language Server for the Lua language
brew "lua-language-server"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Shell for Maven
brew "maven-shell"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# AI coding agent, built for the terminal
brew "opencode"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Messaging and streaming broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Universal proxy platform
brew "sing-box"
# Opinionated Lua code formatter
brew "stylua"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Maintained ctags implementation
brew "universal-ctags"
# Extraction utility for .zip compressed archives
brew "unzip"
# Simple terminal image viewer written in Rust
brew "viu"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Write, edit, and chat about your code with AI
cask "cursor"
# Databases and SQL IDE
cask "datagrip"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Chromium-based web browser
cask "helium-browser"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Java IDE by JetBrains
cask "intellij-idea"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# Agent-centric IDE with spec-driven development
cask "kiro"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# VPN client focusing on security
cask "protonvpn"
# IDE for professional Python development
cask "pycharm"
# App that enables mouse-free UI interaction
cask "shortcat"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Menu bar pomodoro timer
cask "tomatobar"
# Adaptive AI IDE
cask "trae"
# Open-source BitTorrent client
cask "transmission"
# AI code editor
cask "void"
# Rust-based terminal
cask "warp"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Multiplayer code editor
cask "zed"
mas "Boop", id: 1518425043
mas "DevHub", id: 6476452351
mas "Jiffy reader", id: 6444754311
mas "JSON Thru", id: 6741684101
mas "Keynote", id: 409183694
mas "Minimal Twitter", id: 1668204600
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Portal", id: 1436994560
mas "Regex Mate", id: 6479819388
mas "RunCat", id: 1429033973
mas "SnippetsLab", id: 1006087419
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
vscode "amazonwebservices.amazon-q-vscode"
vscode "anthropic.claude-code"
vscode "augment.vscode-augment"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "igorsbitnev.error-gutters"
vscode "jasew.vscode-helix-emulation"
vscode "kevinrose.vsc-python-indent"
vscode "kilocode.kilo-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
